import { Question } from '@/types';

export const northBengal1BengaliQuestions: Question[] = [
  {
    id: 'nb1-q1',
    options: ["খানু", "খানি", "খালুং", "খাসুং", "খাবে", "খাইবে", "খাশি", "খাসি", "খাবার ধরচি", "খাবার নাগসি", "খাইশ", "খাশ", "খাসিত", "খালি", "খাইল", "খাইলো", "খালেক"],
    sentence: ["মুই/আমা দুইদিন আগোত আম", "।"],
    blank: { correctAnswers: ["খানু", "খানি", "খালুং", "খাসুং"] }
  },
  {
    id: 'nb1-q2',
    options: ["খানু", "খানি", "খালুং", "খাসুং", "খাবে", "খাইবে", "খাশি", "খাসি", "খাবার ধরচি", "খাবার নাগসি", "খাইশ", "খাশ", "খাসিত", "খালি", "খাইল", "খাইলো", "খালেক"],
    sentence: ["কালি চেংড়াটা/ সেঙড়াটা ভাত", "।"],
    blank: { correctAnswers: ["খাবে", "খাইবে"] }
  },
  {
    id: 'nb1-q3',
    options: ["খানু", "খানি", "খালুং", "খাসুং", "খাবে", "খাইবে", "খাশি", "খাসি", "খাবার ধরচি", "খাবার নাগসি", "খাইশ", "খাশ", "খাসিত", "খালি", "খাইল", "খাইলো", "খালেক"],
    sentence: ["অ্যালা হামরা /মোরা বিস্কুট", "।"],
    blank: { correctAnswers: ["খাশি", "খাসি", "খাবার ধরচি", "খাবার নাগসি"] }
  },
  {
    id: 'nb1-q4',
    options: ["খানু", "খানি", "খালুং", "খাসুং", "খাবে", "খাইবে", "খাশি", "খাসি", "খাবার ধরচি", "খাবার নাগসি", "খাইশ", "খাশ", "খাসিত", "খালি", "খাইল", "খাইলো", "খালেক"],
    sentence: ["তুই পতিদিন ভাত", "।"],
    blank: { correctAnswers: ["খাইশ", "খাশ", "খাসিত", "খালি"] }
  },
  {
    id: 'nb1-q5',
    options: ["খানু", "খানি", "খালুং", "খাসুং", "খাবে", "খাইবে", "খাশি", "খাসি", "খাবার ধরচি", "খাবার নাগসি", "খাইশ", "খাশ", "খাসিত", "খালি", "খাইল", "খাইলো", "খালেক"],
    sentence: ["গত বছর অক্টোবর মাসে উরমা/ওমরা/ উমরে চকলেট", "।"],
    blank: { correctAnswers: ["খাইলো", "খালেক"] }
  }
];
