import { Question } from '@/types';

export const southBengal1BengaliQuestions: Question[] = [
  {
    id: 'swb1-q1',
    options: ["খালে", "খালাহে", "খালি", "খালো", "খাবে", "খাঁইহন", "খাচি", "খাইস", "খাস", "খালথিং", "খালেথিং", "খারেথিং", "খাইলো", "খালেন"],
    sentence: ["গত সপ্তাহে হামি/ আমি/ ময় আম", "।"],
    blank: { correctAnswers: ["খালে", "খালাহে", "খালি", "খালো"] }
  },
  {
    id: 'swb1-q2',
    options: ["খালে", "খালাহে", "খালি", "খালো", "খাবে", "খাঁইহন", "খাচি", "খাইস", "খাস", "খালথিং", "খালেথিং", "খারেথিং", "খাইলো", "খালেন"],
    sentence: ["কালিকে এই ছালিয়াঁটা ভাত", "।"],
    blank: { correctAnswers: ["খাবে"] }
  },
  {
    id: 'swb1-q3',
    options: ["খালে", "খালাহে", "খালি", "খালো", "খাবে", "খাঁইহন", "খাচি", "খাইস", "খাস", "খালথিং", "খালেথিং", "খারেথিং", "খাইলো", "খালেন"],
    sentence: ["এখন হামরা বিসকুট", "।"],
    blank: { correctAnswers: ["খাঁইহন", "খাচি"] }
  },
  {
    id: 'swb1-q4',
    options: ["খালে", "খালাহে", "খালি", "খালো", "খাবে", "খাঁইহন", "খাচি", "খাইস", "খাস", "খালথিং", "খালেথিং", "খারেথিং", "খাইলো", "খালেন"],
    sentence: ["তঁই/ তুই/ তোই রোজে ভাত", "।"],
    blank: { correctAnswers: ["খাইস", "খাস"] }
  },
  {
    id: 'swb1-q5',
    options: ["খালে", "খালাহে", "খালি", "খালো", "খাবে", "খাঁইহন", "খাচি", "খাইস", "খাস", "খালথিং", "খালেথিং", "খারেথিং", "খাইলো", "খালেন"],
    sentence: ["গত বছর ডিসেম্বর মাসে ওরা/তারা/ অরা চকলেট", "।"],
    blank: { correctAnswers: ["খালথিং", "খালেথিং", "খারেথিং", "খাইলো", "খালেন"] }
  }
];
