import { Question } from '@/types';

export const southBengal2BengaliQuestions: Question[] = [
  {
    id: 'swb2-q1',
    options: ["খানু", "খালাম", "খাবে", "খাবাক", "খাচি", "খাত্নু", "খাতু", "খাইস", "খাস", "খাউ", "খানাই", "খানাক", "খালো", "খানাইক"],
    sentence: ["আগুর সপ্তাই মুই/হাম আম", "।"],
    blank: { correctAnswers: ["খানু", "খালাম"] }
  },
  {
    id: 'swb2-q2',
    options: ["খানু", "খালাম", "খাবে", "খাবাক", "খাচি", "খাত্নু", "খাতু", "খাইস", "খাস", "খাউ", "খানাই", "খানাক", "খালো", "খানাইক"],
    sentence: ["কাইন ইগিয়া ছাউটা ভাত", "।"],
    blank: { correctAnswers: ["খাবে", "খাবাক"] }
  },
  {
    id: 'swb2-q3',
    options: ["খানু", "খালাম", "খাবে", "খাবাক", "খাচি", "খাত্নু", "খাতু", "খাইস", "খাস", "খাউ", "খানাই", "খানাক", "খালো", "খানাইক"],
    sentence: ["এখন হাম সবাই বিস্কুট", "।"],
    blank: { correctAnswers: ["খাচি", "খাত্নু", "খাতু"] }
  },
  {
    id: 'swb2-q4',
    options: ["খানু", "খালাম", "খাবে", "খাবাক", "খাচি", "খাত্নু", "খাতু", "খাইস", "খাস", "খাউ", "খানাই", "খানাক", "খালো", "খানাইক"],
    sentence: ["তুই/ তুঁই/ তুম ডেলি/ দৈনিক ভাত", "।"],
    blank: { correctAnswers: ["খাইস", "খাস", "খাউ"] }
  },
  {
    id: 'swb2-q5',
    options: ["খানু", "খালাম", "খাবে", "খাবাক", "খাচি", "খাত্নু", "খাতু", "খাইস", "খাস", "খাউ", "খানাই", "খানাক", "খালো", "খানাইক"],
    sentence: ["গত বছর অক্টবরে উগা/উগুয়া সবাই চকলেট", "।"],
    blank: { correctAnswers: ["খানাই", "খানাক", "খালো", "খানাইক"] }
  }
];
