import { Question } from '@/types';

export const northBengal2BengaliQuestions: Question[] = [
  {
    id: 'nb2-q1',
    options: ["খাইচু", "খানু", "খালো", "কাহিরহো", "খায়াথা", "খাবে", "খাই", "খান্চ", "খাচি", "খাওথিন", "খাথিন", "খাহাথিন", "খাইস", "খাতেহো", "খাইসলা", "খানচি", "খালাক", "খাইরহান", "খায়ো"],
    sentence: ["আগের হপ্তা মোই/মই/ মুই/হাম/ মঁই/হামি আম", "।"],
    blank: { correctAnswers: ["খাইচু", "খানু", "খালো", "কাহিরহো", "খায়াথা"] }
  },
  {
    id: 'nb2-q2',
    options: ["খাইচু", "খানু", "খালো", "কাহিরহো", "খায়াথা", "খাবে", "খাই", "খান্চ", "খাচি", "খাওথিন", "খাথিন", "খাহাথিন", "খাইস", "খাতেহো", "খাইসলা", "খানচি", "খালাক", "খাইরহান", "খায়ো"],
    sentence: ["কালি/কাল।কল উ/অ/ও।অয় ছোড়াটু ভাত", "।"],
    blank: { correctAnswers: ["খাবে", "খাই", "খান্চ"] }
  },
  {
    id: 'nb2-q3',
    options: ["খাইচু", "খানু", "খালো", "কাহিরহো", "খায়াথা", "খাবে", "খাই", "খান্চ", "খাচি", "খাওথিন", "খাথিন", "খাহাথিন", "খাইস", "খাতেহো", "খাইসলা", "খানচি", "খালাক", "খাইরহান", "খায়ো"],
    sentence: ["অ্যালা/ অ্যাখনে হামিন সবে/হামা/হামলোগ/ হামিন সবেঝান বিস্কুট", "।"],
    blank: { correctAnswers: ["খাচি", "খাওথিন", "খাথিন", "খাহাথিন"] }
  },
  {
    id: 'nb2-q4',
    options: ["খাইচু", "খানু", "খালো", "কাহিরহো", "খায়াথা", "খাবে", "খাই", "খান্চ", "খাচি", "খাওথিন", "খাথিন", "খাহাথিন", "খাইস", "খাতেহো", "খাইসলা", "খানচি", "খালাক", "খাইরহান", "খায়ো"],
    sentence: ["তুই/তয়/তিমি/তুমহা রোজে ভাত", "।"],
    blank: { correctAnswers: ["খাইস", "খাতেহো", "খাইসলা", "খানচি"] }
  },
  {
    id: 'nb2-q5',
    options: ["খাইচু", "খানু", "খালো", "কাহিরহো", "খায়াথা", "খাবে", "খাই", "খান্চ", "খাচি", "খাওথিন", "খাথিন", "খাহাথিন", "খাইস", "খাতেহো", "খাইসলা", "খানচি", "খালাক", "খাইরহান", "খায়ো"],
    sentence: ["আগের বছর/সাল অক্টোবর মাস মে/মাসে উমা/উমিন সব/উমান/উমরা চকলেট", "।"],
    blank: { correctAnswers: ["খালাক", "খাইরহান", "খায়ো", "খায়াথা"] }
  }
];
